from django.shortcuts import render
from django.http import HttpResponse
import random
import json

storys = [
    {1:u'我想成立一个',2:u'项目',3:u'，受众只有',4:u'你',5:u'一个，用一生的时间提高',6:u'你',7:u'的',8:u'生活质量'},
    {1:u'我想和',2:u'你',3:u'从',4:u'诗词歌赋',5:u'聊到',6:u'创行项目'},
    {1:u'祝',2:u'你',3:u'来生不带',4:u'金箍',5:u'不做',6:u'狗',7:u'，有合适的',8:u'项目',9:u'和',10:u'爱你',11:u'的人'},
    {1:u'当我看到了',2:u'你',3:u'，我才知道我为什么来到了',4:u'创行'},
    {1:u'关于',2:u'创行',3:u'，',4:u'你',5:u'有什么想问的都可以来',6:u'吻',7:u'我'},
    {1:u'未经',2:u'思考',3:u'，加了',4:u'创行',5:u'；未经',6:u'允许',7:u'，',8:u'喜欢',9:u'了',10:u'你'},
    {1:u'我就是',2:u'喜欢',3:u'看',4:u'你',5:u'看不惯我，却不得不陪我一起加',6:u'创行',7:u'的样子'},
    {1:u'我做过许多',2:u'调研',3:u'，经过许多类型的',4:u'专案',5:u'，熬过许多',6:u'备赛',7:u'的夜，却只',8:u'爱',9:u'过一个正当最好年龄的',10:u'你'},
    {1:u'这个',2:u'世界',3:u'上有这样一个',4:u'创行',5:u'，是为了这个',6:u'世界',7:u'上有这样一个',8:u'你'},
    {1:u'有些人光是在',2:u'创行',3:u'遇到了就已经',4:u'赚了',5:u'，所以',6:u'不遗憾！'},
    {1:u'',2:u'可爱',3:u'不是',4:u'长久之计',5:u'，可',6:u'爱我',7:u'是'},
    {1:u'给',2:u'你',3:u'一个',4:u'人生建议',5:u':和',6:u'我',7:u'在',8:u'一起'},
    {1:u'',2:u'我爱你',3:u'，如',4:u'鲸',5:u'向',6:u'海',7:u'，如',8:u'鸟',9:u'投',10:u'林',11:u',如',12:u'你',13:u'入',14:u'创行'},
    {1:u'',2:u'爱',3:u'上',4:u'你',5:u'之前，想',6:u'单枪匹马',7:u'去闯荡',8:u'江湖',9:u' ，看看这',10:u'五彩斑斓',11:u'的',12:u'世界',13:u'。',14:u'爱',15:u'上',16:u'你',
    17:u'之后，觉得',18:u'江湖',19:u'太远了，我',20:u'不去',21:u'了，我只想给',22:u'你',23:u'做饭，陪',24:u'你',25:u' 睡觉，陪',26:u'你',27:u'加',28:u'创行'},
    {1:u'谢谢',2:u'你',3:u'长得这么',4:u'好看',5:u'，',6:u'调研',7:u'的日子就算再',8:u'辛苦',9:u'，看到',10:u'你',11:u'就',12:u'开心',13:u'很多了'},
]

def dashboard(request):
    return render(request,'base.html')

def index(request):
    return render(request, 'index.html')

def name(request):
    name = request.GET['name']
    story =  json.dumps(random.choice(storys))
    index = list(map(str, range(len(story))))
    capital = index[::2]
    enactus = {'name':name,'story':story,'index':index,'capital':capital}
    return render(request, 'name.html', enactus)
